УТ_для_edt/src/Documents/смартБонусыЗаМаркетинговыеМероприятия/смартБонусыЗаМаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартБонусыЗаМаркетинговыеМероприятия</name>
  <comment>#6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <registerRecords>AccumulationRegister.смартБонусыЗаМаркетинговыеМероприятия</registerRecords>
  <attributes>
    <name>ПроцентНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Бонусы</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркетинговоеМероприятие</name>
      <type>
        <types>DocumentRef.МаркетинговыеМероприятияДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыручки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартASP_ТипыБонусов/смартASP_ТипыБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартASP_ТипыБонусов</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <enumValues>
    <name>УчастиеВПродажахКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>ЗапускиОборудования</name>
  </enumValues>
  <enumValues>
    <name>РешениеЗадачСЦ</name>
  </enumValues>
  <enumValues>
    <name>Командировки</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеСтандартаСО</name>
  </enumValues>
  <enumValues>
    <name>Переработки</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ЗаЧипы</name>
  </enumValues>
  <enumValues>
    <name>Знания</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеМаркетинговыхМероприятий</name>
    <comment>#6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартБонусыЗаМаркетинговыеМероприятия/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицасмартASP_НакоплениеБонусов(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицасмартБонусыЗаМаркетинговыеМероприятия(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры 

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата 						КАК Период
	|ИЗ
	|	Документ.смартБонусыЗаМаркетинговыеМероприятия КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";	
	Реквизиты = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры 

Функция ТекстЗапросаТаблицасмартASP_НакоплениеБонусов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартASP_НакоплениеБонусов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.смартASP_ТипыБонусов.ПроведениеМаркетинговыхМероприятий) КАК ТипБонуса,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.Инженер КАК Инженер,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.СуммаБонуса КАК Сумма
	|ИЗ
	|	Документ.смартБонусыЗаМаркетинговыеМероприятия.Бонусы КАК смартБонусыЗаМаркетинговыеМероприятияБонусы
	|ГДЕ
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаТаблицасмартБонусыЗаМаркетинговыеМероприятия(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартБонусыЗаМаркетинговыеМероприятия";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.Инженер КАК Инженер,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.ЗаказКлиента КАК ЗаказКлиента,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.Номенклатура КАК Номенклатура,
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.СуммаБонуса КАК Сумма
	|ИЗ
	|	Документ.смартБонусыЗаМаркетинговыеМероприятия.Бонусы КАК смартБонусыЗаМаркетинговыеМероприятияБонусы
	|ГДЕ
	|	смартБонусыЗаМаркетинговыеМероприятияБонусы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции    

#КонецОбласти 

#КонецОбласти

#КонецЕсли
